Repository: devicemanager/codeapp
Catalog: CodeApp/Localization/*.lproj/Localizable.strings
Languages: de

source: Welcome Message
de: # Code App ##### **v1.10.2 (March 2025)** #### Start [Neue Datei](https://thebaselab.com/code/newfile) [Datei öffnen](https://thebaselab.com/code/openfile) [Ordner öffnen](https://thebaselab.com/code/openfolder) #### Hilfe [Dokumentation](https://code.thebaselab.com) [GitHub](https://github.com/thebaselab/codeapp) [E-Mail](mailto:support@thebaselab.com) [Twitter](https://twitter.com/thebaselab)

source: Changelog.message
de: ### 1.10.2 (March 2025) - Russische Lokalisierung ### 1.10.1 (October 2024) - Fehlerbehebungen ### 1.10.0 (October 2024) - Sprachserver für Python und Java - Unterstützung für mehr Sprachen im Monaco-Editor ### 1.9.0 (July 2024) - SSH - Proxy-Sprung - 2FA / Keyboard-Interaktive Authentifizierung - Behebt ein Problem, bei dem bestimmte SSH-Git-Repositories nicht geklont werden können ### 1.8.0 (June 2024) - Editor - Runestone-Editor-Modus (ein Editor mit nativen Textauswahlsteuerelementen) - Syntaxhervorhebung für Kotlin - Die Tastatur-Symbolleiste kann jetzt aktiviert/deaktiviert werden, ohne die App neu zu starten - Terminal-Verbesserungen - Benutzerdefinierte Schriftart - Tastatur-Symbolleiste ### 1.7.4 (May 2024) - Behebt ein Problem beim Einfügen von Text mit der Tastatursymbolleiste ### 1.7.3 (May 2024) - Behebt ein Problem, bei dem die Tastatursymbolleiste nicht deaktiviert werden kann ### 1.7.2 (May 2024) - Interaktive Eingaben in lokalem Java / Node.js - Behebt ein Problem mit Java-Programmen mit mehreren Dateien ### 1.7.1 (March 2024) - Möglichkeit, laufende C-Programme zu beenden ### 1.7.0 (February 2024) - Vim-Modus - Ziehen Sie Dateien und Ordner per Drag & Drop in den Explorer - Möglichkeit, vom Benutzer installierte Schriftarten zu verwenden – Entfernen Sie nicht unterstützte Header in stdc++.h - Verbessertes Scrollen im Editor ### 1.6.0 (January 2024) - Verbesserungen der lokalen Sprache - Lokales Java (OpenJDK 8) - Sie können Java-Programme jetzt offline mit den Befehlen „javac“ und „java“ kompilieren und ausführen - Node.js 18.19.0 - PHP 8.3.2 (mit Zlib) – Die Bestätigungsaufforderung beim Löschen von Dateien ist jetzt optional und standardmäßig deaktiviert ### 1.5.3 (December 2023) - Behebt einen Fehler, bei dem das Terminal standardmäßig ~ verwendet ### 1.5.2 (December 2023) - SSH Remote löst jetzt symbolische Links auf ### 1.5.1 (October 2023) - Behebt Probleme mit der FTP-Remote – Behebt einen Fehler, bei dem die Registerkarte „Portweiterleitung“ immer im kompakten Bildschirm angezeigt wird ### 1.5.0 (October 2023) - Portweiterleitung in SSH Remote – Behebt ein Problem, bei dem bestimmte SSH-Remotes nicht authentifiziert werden können – Option zum Auflösen des Home-Pfads beim Herstellen einer Verbindung zu einer Fernbedienung ### 1.4.7 (September 2023) - Behebt einige Probleme in der SSH-Remote ### 1.4.6 (August 2023) - Versionskontrolle - Authentifizierung - SSH-Schlüsselauthentifizierung - Mehrere Anmeldeinformationen - Neue Eigenschaften - Von der Fernbedienung ziehen - Konfliktlösung - Zweige und Tags erstellen/löschen - Tags verschieben - lg2-Befehl - Weitere Verbesserungen - Einstellbare Seitenleistenbreite - bits/stdc++.h-Header in Clang – Option zur Verwendung eines Remote-C-Compilers anstelle des lokalen – Behebt einen Fehler, bei dem Schlüsseldateien nicht importiert werden konnten - Unterstützung für den iOS-Sperrmodus ### v1.4.5 (July 2023) - Behandeln Sie iCloud-Dateien ordnungsgemäß - Verbesserungen der Benutzeroberfläche ### v1.4.4 (May 2023) - Option zum Deaktivieren von Schriftligaturen - Privater In-Memory-SSH-Schlüssel - andere Verbesserungen ### v1.4.3 (January 2023) - Fehlerbehebung - Japanische Lokalisierung - Community-Vorlagen ### v1.4.1 (December 2022) - Fehlerbehebung ### v1.4.0 (December 2022) - PDF-Vorschau - Allgemeine Leistungs- und Stabilitätsverbesserungents - Split-View-Unterstützung ### v1.3.6 (October 2022) - Aktualisieren Sie Node.js auf v16.17.0 - Syntax-Highlighting für Svelte - Neue Editorthemen - Behandeln Sie Terminalterminierungssignale richtig - Unterstützt das Öffnen von Verzeichnissen mit dem Befehl `Code`. - Beheben Sie einen Fehler, der verhindert, dass Emmet funktioniert ### v1.3.5 (September 2022) - Verbesserungen der Benutzeroberfläche - Unterstützung für das Verschieben von Dateien im Explorer - Unterstützung für das Herunterladen von Dateien von Remote-Servern - Möglichkeit, verschiedene Fernbedienungen für Git-Push auszuwählen ### v1.3.4 (June 2022) - Terminal support for SFTP - Support for Fira Code and custom fonts - Korean localization - New documentation website - General improvements ### v1.3.3 (May 2022) - Bug fixes ### v1.3.2 (May 2022) - Fixes a bug that prevents existing users to access themes ### v1.3.1 (May 2022) - Bug fixes - You can now use custom Java entry class name - Introducing Code+ - A subscription service that allows us to bring Code to everyone and unlocks all themes. Existing users continue to have full access to the app. ### v1.3.0 (May 2022) - Remote Support (SFTP and FTP) - Dynamic Type support - Experimental feature: Spell check for text files ### v1.2.13 (March 2022) - Compatibility with iOS 15.4 - Internationalization support for Node.js ### v1.2.12 (March 2022) - Critical bug fix ### v1.2.10 (March 2022) - Custom keyboard shortcuts - Text selection by sliding over line numbers - UI improvements - Fixes problems where editor sometimes would not load - Node.js 16.13.2 ### v1.2.9 (January 2022) - Fixes problems where: - certain keys do not work on European keyboard layouts (#237) - `curl` no longer works (#330) - a default argument makes some npm commands crash (#326) ### v1.2.8 (December 2021) - Fixes problems where: - ssh-keygen causes terminal to stall (#314) - editor sometimes show a blank screen - Adds syntax highlighting for Terraform (#319) ### v1.2.7 (December 2021) - General improvements ### v1.2.6 (September 2021) - Compatibility with the latest iOS version - Other improvements ### v1.2.5 (July 2021) - Terminal - Fixed some problems regarding clang / clang++ ### v1.2.4 (June 2021) - Editor - Fixed a problem where mouse / trackpad selection no longer works - Updated to TypeScript definition to 4.2.4 - Interface - New compact side-bar design for iPhone - Ability to reorder editor tabs - Improved readability for Xcode Theme - Ability to duplicate files or folders in context menu - Performance - Enhanced performance when opening SMB drives from Files App - Git - Improved compatability with various repositories remotes - In-line Diff indicators - Experimental Git CLI tool - Terminal - Autocompletion for file path - Open code in editor with `code <file>` - Runtime - Clang (Run C program with `clang main.c` and `./a.out`) - Clang++ (Run C++ program with `clang++ main.cpp` and `./a.out`) - PHP (Run PHP program with `php` and host a web-server with `php -S localhost:<port>`) --- ### v1.2.3 (April 2021) - Editor - 6 Additional Color Themes - Read-only mode - Built-in types for Node.js - Support for @types definitions - Explorer - Multi-file searching - Python Runtime - Built-in Matplotlib, Pandas - Other - UI State Restoration - Localisation for German - Bug fixes and other improvements --- ### v1.2.1 (March 2021) - Node.js runtime - Run Javascript offline - Install npm modules - Install Javascript commands globally (tsc, prettier etc.) - New terminal commands: npm, npx, node - Python 3.9.2 runtime - Run Python offline - Install modules with pip - Install Python commands globally - New terminal commands: pip, python, python3 - Editor - `Problems` tab - New Markdown style - Syntax highlighting for Vue - Smooth Scrolling option for devices with high refresh rate - Terminal - Now supports light colour scheme - File explorer - Reduced row height - Bug fixes --- ### v1.1.9 (February 2021) - Language - Faster execution - Bug fixes --- ### v1.1.8 (February 2021) - Text Editor - Migration to TextMate grammar (More advanced syntax highlighting) - Support for more languages (Groovy, HLSL, Log, Makefile, Shaderlab, Fortran, Matlab) - Fixed a bug where the editor sometimes does not to pointer clicks - New keyboard toolbar - Version Control - Improved performance and reliability - Staging changes - Switching branch - Detached head mode - Revert changes - Language - Support for Groovy - Built-in Terminal - Support for SSH - Bug fixes - Explorer - Folding states for directories are now perserved when the sidebar is toogled off - Ability to expand folder by tapping on the folder name - Other - Width of the sidebar is reduced - Theme is now temporaily removed to support the new syntax highlighting system - JSON Intellisense is temporaily disabled --- ### v1.1.7 (January 2021) - Text Editor - Changes are now written to disk when you run your code or dismiss the keyboard - Fixed a problem where virtual keyboard sometimes does not show up - Version Control - Ability to clone private repositories - Ability to push, pull and sync from remotes - Fixed a problem where cloned repository is not properly named - Built-in Terminal - 70+ Linux commands (ls, cd, nslookup etc.) - Bash-like user primitives such as piping, history and completion - Press tab to show all available commands - Explorer - Files and directories are now sorted alphabetically - Files or directories starting with a dot are now hidden by default - Ability to select items with a Two-Finger pan gesture - Other improvements - You can now open files with Code App from Files app or other Apps directly - You can now hold the app icon from Home Screen to reveal recent documents - Fixed a typo

source: Send us an Email
de: Senden Sie uns eine E-Mail

source: Open an Issue on GitHub
de: Öffnen Sie einen Issue auf GitHub

source: Clear console
de: Konsole löschen

source: Kill Process
de: Prozess beenden

source: Synchronize Changes
de: Änderungen synchronisieren

source: You don't have any open editor.
de: Sie haben keinen offenen Editor.

source: This will pull remote changes down to your local repository and then push local commits to the upstream branch. Conflicts will be merged and overriden by the local copy.
de: Dadurch werden Remote-Änderungen in Ihr lokales Repository übertragen und lokale Commits an den Upstream-Zweig weitergeleitet. Konflikte werden von der lokalen Kopie zusammengeführt und überschrieben.

source: User Name
de: Benutzername

source: Erase
de: Löschen

source: This will erase all user settings, including author identity and credentials.
de: Dadurch werden alle Benutzereinstellungen gelöscht, einschließlich der Autorenidentität und der Anmeldeinformationen.

source: Erase all settings
de: Alle Einstellungen löschen

source: Release Notes
de: Versionshinweise

source: New File
de: Neue Datei

source: Open File
de: Datei öffnen

source: Open Editors
de: Editor öffnen

source: SEARCH
de: SUCHEN

source: Search
de: Suche

source: Results
de: Ergebnisse

source: Search Text
de: Suchtext

source: Search File
de: Datei suchen

source: Quick add
de: Schnell hinzufügen

source: Custom
de: Benutzerdefiniert

source: Where
de: Woher

source: Current Folder
de: Aktueller Ordner

source: Add File
de: Datei hinzufügen

source: PROBLEMS
de: PROBLEME

source: Options
de: Optionen

source: Close All
de: Alles schliessen

source: Close Workspace
de: Arbeitsbereich schliessen

source: Preview in Safari
de: Vorschau in Safari

source: Mini Map
de: Minikarte

source: Line Numbers
de: Zeilennummern

source: OTHERS
de: ANDERE

source: Tab Size
de: Tab Grösse

source: Settings
de: Einstellungen

source: General
de: Allgemein

source: Accent
de: Akzent

source: Font Size
de: Schriftgröße

source: Editor Font Size
de: Schriftgröße des Editors

source: Terminal Font Size
de: Terminal-Schriftgröße

source: Bracket Completion
de: Klammervervollständigung

source: Rate Code App
de: Code App bewerten

source: About
de: Über uns

source: Done
de: Fertig

source: Recent
de: vor Kurzem

source: Show in Files App
de: In Dateien anzeigen

source: Copy Relative Path
de: Relativen Pfad kopieren

source: Delete
de: Löschen

source: Color Scheme
de: Farbschema

source: Text Wrap
de: Textumbruch

source: Render Whitespace
de: Leerzeichen machen

source: Share
de: Teilen

source: Rename
de: Umbenennen

source: Assign as workspace folder
de: Als Arbeitsbereichsordner zuweisen

source: Select For Compare
de: Zum Vergleich auswählen

source: Compare With Selected
de: Vergleiche mit ausgewählten

source: Version Control
de: Versionskontrolle

source: Author Identity
de: Author Identität

source: Authentication
de: Authentifizierung

source: Email address
de: E-Mail-Adresse

source: Save
de: Speichern

source: Close Editor
de: Editor schliessen

source: Zoom in
de: Vergrössern

source: Zoom out
de: Verkleinern

source: Show Explorer
de: Zeige Explorer

source: Show Search
de: Zeige Suche

source: Show Source Control
de: Zeige Source Control

source: User Settings
de: Benutzereinstellungen

source: Show Panel
de: Zeige Panel

source: Hide Panel
de: Verstecke Panel

source: Run Code
de: Code ausführen

source: New Folder
de: Neuer Ordner

source: The folder currently opened doesn't have a git repository.
de: Der aktuell geöffnete Ordner hat kein Git-Repository.

source: Example: https://github.com/thebaselab/codeapp.git
de: Beispiel: https://github.com/thebaselab/codeapp.git

source: Initialize Repository
de: Repository initialisieren

source: Clone Repository
de: Repository klonen

source: Keyboard Toolbar
de: Tastaturleiste

source: Always Open In New Tab
de: Immer in neuem Tab öffnen

source: Changes
de: Änderungen

source: Message (⌘Enter to commit)
de: Nachricht (⌘Enter zum committen)

source: Staged Changes
de: Inszenierte Änderungen

source: No changes are made in the working directory.
de: Im Arbeitsverzeichnis werden keine Änderungen vorgenommen

source: Uncommited changes will be lost. Do you wish to proceed?
de: Nicht festgeschriebene Änderungen gehen verloren. Möchten Sie fortfahren?

source: No changes are made in this file
de: In dieser Datei werden keine Änderungen vorgenommen

source: Smooth Scrolling
de: flüssiges Scrollen

source: Welcome
de: Willkommen

source: Licenses
de: Lizenzen

source: Version
de: Ausführung

source: Code App by thebaselab
de: Code App von thebaselab

source: Themes
de: Themen

source: Read-only Mode
de: schreibgeschützter Modus

source: Show Welcome Page
de: Begrüßungsseite anzeigen

source: UI State Restoration
de: Wiederherstellung des UI-Status

source: Open in Tab
de: Öffnen Sie in Tab

source: Show Command in Terminal
de: Befehl im Terminal anzeigen

source: Duplicate
de: Duplikat

source: Console Font Size
de: Konsolen-Schriftgröße

source: Custom Keyboard Shortcuts
de: Benutzerdefinierte Tastaturkürzel

source: You don't have any saved remote.
de: Sie haben keine gespeicherten Remote.

source: New remote
de: Neuer remote

source: Protocol
de: Protokoll

source: Address
de: Adresse

source: Username
de: Benutzername

source: Password
de: Passwort

source: Use Key Authentication
de: Verwendet Schlüsselauthentifizierung

source: Remember address
de: Adresse speichern

source: Connect
de: Verbinden

source: Disconnect
de: Trennen

source: Current Remote
de: Aktueller remote

source: Remember credentials
de: Anmeldeinformationen speichern

source: Key passphrase
de: Schlüssel-Passphrase

source: Show public key
de: öffentlichen Schlüssel anzeigen

source: Experimental Features
de: Experimentelle Funktionen

source: Enable spell check in text files
de: Rechtschreibprüfung in Textdateien aktivieren

source: Spell checking on content changed
de: Rechtschreibprüfung bei Inhaltänderung

source: common.open_folder
de: Ordner öffnen

source: common.compare
de: Vergleichen

source: common.overwrite
de: Überschreiben

source: common.save
de: Speichern

source: common.dont_save
de: Nicht speichern

source: common.cancel
de: Abbrechen

source: common.revert
de: Rückgängig machen

source: common.delete
de: Löschen

source: common.reset
de: Zurücksetzen

source: common.done
de: Fertig

source: common.import
de: Importieren

source: common.add
de: Hinzufügen

source: common.create
de: Erstellen

source: common.remove
de: Entfernen

source: common.move
de: Bewegen

source: common.username
de: Benutzername

source: common.password
de: Passwort

source: common.continue
de: Fortfahren

source: notification.source
de: Quelle: %@

source: subscription.codeplus
de: Code+

source: subscription.title %@
de: 12 Monate für %@

source: subscription.message
de: Machen Sie Code für alle verfügbar und schalten Sie alle Themen frei. Der Code bleibt Open Source und vorhandene Funktionen bleiben ohne Abonnement verfügbar.

source: subscription.payment.description %@ %@
de: Beginnend am %@, Ihre Mitgliedschaft wird automatisch um %@ pro Jahr aktualisiert, bis Sie sie abbestellen.

source: subscription.payment.disallowed
de: Ihre Geräte-Konfiguration erlaubt keine Zahlungen.

source: subscription.join
de: Code+ beitreten

source: terms_of_use
de: Nutzungsbedingungen

source: code.and.privacy
de: Datenschutz-Bestimmungen

source: credentials.note
de: Anmeldedaten werden in der Secure Enclave auf Ihrem Gerät gespeichert. Wir haben keinen Zugriff darauf.

source: settings.editor.font
de: Editor-Schriftart

source: settings.editor.font.reset
de: Standard

source: settings.editor.font.ligatures
de: Schrift Ligaturen

source: settings.editor.font.show_all_fonts
de: Alle Schriftarten anzeigen

source: settings.editor.vim.enabled
de: Vim aktiviert

source: settings.explorer.confirm_before_delete
de: Bestätigen Sie vor dem Löschen

source: settings.explorer.show_hidden_files
de: Versteckte Dateien anzeigen

source: settings.runestone.editor
de: Runestone Editor

source: settings.runestone.editor.notes
de: Runestone ist ein Editor mit nativer Textauswahlunterstützung. Einige Funktionen sind in diesem Modus nicht verfügbar.

source: settings.terminal.font
de: Schriftart

source: settings.language_service
de: Sprachdienst

source: settings.language_service.enable
de: Sprachdienst aktivieren

source: settings.language_service.notes
de: Der Sprachdienst bietet Autovervollständigung, statische Codeanalyse und andere Sprachfunktionen. Diese Funktion ist derzeit für Python und Java verfügbar.

source: settings.about.change_app_language
de: App-Sprache ändern

source: panels.no_panel_selected
de: Kein Panel ausgewählt

source: sidebar.no_section_selected
de: Kein Abschnitt ausgewählt

source: errors.script_already_running
de: Ein Skript wird bereits ausgeführt. Beenden Sie es, bevor Sie ein anderes ausführen.

source: errors.fs.not_implemented
de: Diese Funktion ist noch nicht implementiert.

source: errors.fs.scheme_not_registered
de: Das Dateisystem-Schema ist nicht registriert.

source: errors.fs.invalid_host
de: Ungültiger Hostname.

source: errors.fs.unspported_encoding
de: Nicht unterstützte Zeichenkodierung.

source: errors.fs.unknown
de: Unbekannter Fehler.

source: errors.fs.connection_failure
de: Verbindungsfehler.

source: errors.fs.authentication_failure
de: Authentifizierungsfehler.

source: errors.fs.attempting_to_copy_parent_to_child
de: Versuch, ein Verzeichnis in sich selbst zu kopieren.

source: errors.fs.attempting_to_copy_oneself
de: Sie versuchen, sich selbst zu kopieren.

source: errors.fs.already_connecting_to_a_host
de: Es wird bereits eine Verbindung zu einem Host hergestellt.

source: errors.fs.jumping_not_supported_for_host
de: Jumping wird für diesen Host nicht unterstützt.

source: errors.fs.missing_jumping_server
de: Fehlender Jumping-Server.

source: errors.source_control.authentication_failed
de: Authentifizierung fehlgeschlagen: Möglicherweise müssen Sie Ihre Git-Anmeldeinformationen konfigurieren.

source: errors.source_control.clone_authentication_failed
de: Authentifizierung fehlgeschlagen: Entweder ist die Repository-URL falsch oder Sie müssen Ihre Git-Anmeldeinformationen konfigurieren.

source: errors.source_control.no_staged_changes
de: Es gibt keine inszenierten Änderungen.

source: errors.source_control.empty_commit_message
de: Commit-Nachricht darf nicht leer sein

source: errors.source_control.invalid_url
de: ungültige URL

source: errors.unknown_file_format
de: Unbekanntes Dateiformat.

source: errors.editor_does_not_exist
de: Der Editor existiert nicht.

source: errors.editor_is_not_ready
de: Der Editor ist nicht bereit.

source: errors.failed_to_save_file.encoding.failed
de: Fehler beim Speichern der Datei. Die Zeichenkodierung ist möglicherweise nicht unterstützt.

source: errors.file_modified_by_another_process
de: Die Datei wurde von einem anderen Prozess geändert.

source: errors.failed_to_import_key
de: Fehler beim Importieren des Schlüssels.

source: errors.port_forward.service_unavailable
de: Dienst nicht verfügbar

source: errors.port_forward.invalid_address
de: Ungültige Adresse

source: errors.port_forward.address_already_in_use
de: Errno 48: Adresse wird bereits verwendet

source: errors.operation_cancelled_by_user
de: Operation abgebrochen

source: errors.sftp.invalid_host_url
de: Ungültige Host-URL

source: errors.sftp.invalid_jump_host_url
de: Ungültige Jump-Host-URL

source: errors.sftp.unable_to_start_portforward_service
de: Portweiterleitungsdienst kann nicht gestartet werden

source: errors.sftp.auth_failure
de: Authentifizierungsfehler

source: errors.sftp.failed_to_perform_operation
de: Fehler beim Ausführen der Operation

source: errors.sftp.unable_to_start_shell
de: Shell kann nicht gestartet werden

source: file.copy
de: Kopieren nach..

source: file.download
de: Herunterladen auf..

source: file.confirm_save %@
de: Möchten Sie die Änderungen an %@ speichern?

source: file.confirm_delete %@
de: Möchten Sie %@ wirklich löschen?

source: file.confirm_move_into %@ %@
de: Möchten Sie %@ wirklich in %@ verschieben?

source: file.reopen_with_encoding
de: Mit Zeichenkodierung erneut öffnen

source: file.download_now
de: Jetzt herunterladen

source: file.upload
de: Hochladen

source: actions.new_window
de: Neues Fenster

source: actions.switch_to_monaco_editor
de: Zu Monaco-Editor wechseln

source: actions.switch_to_runestone_editor
de: Zu Runestone-Editor wechseln

source: remote.connecting
de: Verbindung zum Host herstellen

source: remote.connected
de: Erfolgreich verbunden

source: remote.ssh_key_not_found
de: SSH-Schlüssel nicht in Documents/.ssh/id_rsa gefunden. Generieren Sie eine, indem Sie ssh-keygen im Terminal ausführen.

source: remote.reload_key
de: Schlüssel neu laden

source: remote.passphrase_for_private_key
de: Passphrase für privaten Schlüssel

source: remote.credentials_for %@
de: Anmeldeinformationen für %@

source: remote.enter_credentials
de: Geben Sie Ihre Anmeldeinformationen ein

source: remote.authenticate_to %@
de: Authentifizieren bei %@

source: remote.one_or_more_hosts_use_this_host_as_jump_proxy
de: Einer oder mehrere Hosts verwenden diesen Host als Jump-Proxy

source: remote.confirm_delete_are_you_sure_to_delete
de: Möchten Sie %@ wirklich löschen?

source: remote.use_jump_server
de: Jump-Server verwenden

source: remote.jump_using
de: Verwenden von %@

source: source_control.title
de: Quellcodeverwaltung

source: source_control.username
de: Benutzername

source: source_control.password_based_authentication
de: Authentifizierung mit Passwort

source: source_control.ssh_authentication
de: SSH-Authentifizierung

source: source_control.private_key_content
de: Inhalt des privaten Schlüssels

source: source_control.editing_ssh_private_key
de: Bearbeiten des SSH-Privatschlüssels

source: source_control.pat
de: persönliches Zugangstoken

source: source_control.pat_or_password
de: persönliches Zugangstoken oder Passwort

source: source_control.ssh_key_reset_confirmation
de: Möchten Sie den SSH-Schlüssel wirklich zurücksetzen?

source: source_control.url_specific_credentials
de: URL-spezifische Anmeldeinformationen
