Repository: devicemanager/codeapp
Catalog: CodeApp/Localization/*.lproj/Localizable.strings
Languages: de

source: source_control.add_new_credentials
de: Neue Anmeldeinformationen hinzufügen

source: source_control.git_authentication
de: Git-Authentifizierung

source: source_control.repository_initialized
de: Repository initialisiert

source: source_control.commit_succeeded
de: Commit erfolgreich

source: source_control.uploading_objects
de: Hochladen von Objekten

source: source_control.pushing_to_remote
de: Pushen zu remote

source: source_control.push_succeeded
de: Push erfolgreich

source: source_control.fetching_from_origin
de: Vom Ursprung abrufen

source: source_control.fetch_succeeded
de: Abruf erfolgreich

source: source_control.clone_succeeded
de: Klonen war erfolgreich

source: source_control.cloning_into
de: Klonen in %@

source: source_control.error
de: Klonfehler: %@

source: source_control.revert_succeeded
de: Zurücksetzen erfolgreich

source: source_control.remote_credentials
de: Remote-Anmeldeinformationen

source: source_control.credentials.note
de: In vielen Fällen müssen Sie zur Authentifizierung ein persönliches Zugriffstoken anstelle eines Kennworts verwenden. Um mehr darüber zu erfahren:

source: source_control.confirm_revert %@
de: Möchten Sie %@ wirklich zurücksetzen?

source: source_control.retrieving_changes
de: Änderungen abrufen

source: source_control.community_templates
de: Community-Vorlagen

source: source_control.community_templates.description
de: Community-Vorlagen sind Repositories auf GitHub mit dem Tag #codeapp-template. Sie können dies im Einstellungsmenü deaktivieren.

source: source_control.clone
de: Klonen

source: source_control.pull
de: Pull

source: source_control.pulling_from_remote
de: Vom Remote-Server abrufen

source: source_control.pull_succeeded
de: Pull erfolgreich

source: source_control.checkout.select_branch_or_tag
de: Wählen Sie einen Branch oder Tag aus

source: source_control.public_key
de: Öffentlicher Schlüssel

source: source_control.editing_public_key
de: Bearbeiten des öffentlichen Schlüssels

source: source_control.key_content
de: Schlüsselinhalt

source: source_control.private_key
de: Privater Schlüssel

source: source_control.passphrase_optional
de: Passphrase (optional)

source: source_control.hostname
de: Hostname

source: source_control.credentials
de: Anmeldeinformationen

source: source_control.new_credentials
de: Neue Anmeldeinformationen

source: source_control.hostname_based_credentials
de: Hostname-basierte Anmeldeinformationen

source: source_control.add_key_based_credentials
de: Schlüsselbasierte Anmeldeinformationen hinzufügen

source: source_control.add_password_based_credentials
de: Passwortbasierte Anmeldeinformationen hinzufügen

source: source_control.create_branch
de: Branch erstellen

source: source_control.branch_name
de: Branch-Name

source: source_control.branch
de: Branch

source: source_control.confirm_delete_branch %@
de: Möchten Sie den Branch %@ wirklich löschen?

source: source_control.branch_deleted
de: Branch %@ gelöscht

source: source_control.tag
de: Tag

source: source_control.create_tag
de: Tag erstellen

source: source_control.tag_name
de: Tag-Name

source: source_control.annotation_optional
de: Annotation (optional)

source: source_control.tag_created
de: Tag %@ erstellt

source: source_control.confirm_delete_tag
de: Möchten Sie den Tag %@ wirklich löschen?

source: source_control.tag_deleted
de: Tag %@ gelöscht

source: source_control.pushing_tag_to_remote
de: Tag %@ zu %@ pushen

source: source_control.push
de: Push

source: source_control.commit
de: Commit

source: source_control.message_command_enter_to_commit
de: Nachricht (⌘Enter zum committen)

source: panel.problems.no_problems_detected
de: keine Probleme im Arbeitsbereich erkannt.

source: panel.execution.press_play_to_execute_code
de: Drücken Sie die Wiedergabetaste, um den Code auszuführen. Die Programmeingabe muss vor der Ausführung ausgefüllt werden.

source: panel.execution.program_input
de: Programmeingabe..

source: panel.execution.input
de: Eingabe

source: panel.execution.output
de: Ausgabe

source: panel.execution.split_view
de: Split View

source: panel.execution.title
de: Ausführung

source: local.execution.title
de: Lokale Ausführung

source: remote.setup_remote_server
de: Dokumentation zur Fernzugriffsfunktion

source: remote.private_key_content
de: Inhalt des privaten Schlüssels

source: remote.setup_note
de: Um Schlüsselpaare zu generieren, führen Sie ssh-keygen im Terminal aus. Lassen Sie die Passphrase leer, falls keine vorhanden ist.

source: remote.import_from_file
de: Importieren aus Datei

source: remote.port_forward.new_port_forward
de: Neue Portweiterleitung

source: remote.port_forward.local_port_or_address
de: Lokaler Port oder Adresse

source: remote.port_forward.remote_port_or_address
de: Remote-Port oder Adresse

source: remote.port_forward.port_forwarding
de: Portweiterleitung

source: remote.port_forward.configure_description
de: Um eine Portweiterleitung zu konfigurieren, geben Sie die lokale und die Remote-Adresse ein. Wenn Sie eine Adresse eingeben, wird der Port 22 verwendet.

source: remote.port_forward.address_example
de: z.B. 6000 oder 127.0.0.1:6000

source: remote.settings.ssh_remote
de: SSH Remote

source: remote.settings.resolve_home_path
de: Pfad auflösen
